Repository: Cursyy/GoRide
Catalog: django/locale/*/LC_MESSAGES/djangojs.po
Languages: ga, uk

source: Could not load events:
ga: Níorbh fhéidir imeachtaí a luchtú:
uk: Не вдалося завантажити події:

source: Please try again later.
ga: Bain triail eile as níos déanaí.
uk: Будь ласка, спробуйте пізніше.

source: Unnamed Event
ga: Imeacht gan ainm
uk: Подія без назви

source: Date N/A
ga: Dáta N/A.
uk: Дата невідома

source: Venue N/A
ga: Ionad n/a
uk: Місце проведення невідоме

source: View Event
ga: Imeacht Féach
uk: Переглянути подію

source: Get Directions
ga: Faigh treoracha
uk: Отримати напрямки

source: Directions unavailable
ga: Treoracha nach bhfuil ar fáil
uk: Напрямки недоступні

source: Getting location...
ga: Suíomh a fháil ...
uk: Отримання локації ...

source: My Location
ga: Mo Suíomh
uk: Моє місцезнаходження

source: Use My Location
ga: Úsáid mo shuíomh
uk: Використовуйте моє місцезнаходження

source: Could not get your location. Please ensure location services are enabled and permissions are granted.
ga: Níorbh fhéidir do shuíomh a fháil.Cinntigh le do thoil go bhfuil seirbhísí suímh cumasaithe agus go ndeonaítear ceadanna.
uk: Не вдалося отримати своє місцезнаходження.Будь ласка, переконайтеся, що послуги місцезнаходження ввімкнуться та надаються дозволи.

source: Geolocation is not supported by your browser.
ga: Ní thacaíonn do bhrabhsálaí le geolocation.
uk: Геолокація не підтримується вашим браузером.

source: Max spaces
ga: Uas -spásanna
uk: Максимальна кількість місць

source: Free spaces
ga: Spásanna saor in aisce
uk: Вільні місця

source: Error loading vehicles. Please try again later.
ga: Earráid ag luchtú feithiclí.Bain triail eile as níos déanaí.
uk: Помилка завантаження транспортних засобів. Будь ласка, спробуйте пізніше.

source: Type
ga: Tíopáil
uk: Тип

source: Battery charge
ga: Muirear ceallraí
uk: Заряд акумулятора

source: No vehicles match the current criteria
ga: Níl aon fheithicil ag teacht leis na critéir reatha
uk: Жодне транспортні засоби не відповідають поточним критеріям

source: Show on Map
ga: Taispeáin ar léarscáil
uk: Показати на карті

source: Map N/A
ga: Léarscáil N/A.
uk: Карта відсутня

source: Battery
ga: Bataire
uk: Акумулятор

source: Price per hour
ga: Praghas in aghaidh na huaire
uk: Ціна на годину

source: Please select a station or vehicle first, and ensure location is enabled
ga: Roghnaigh stáisiún nó feithicil ar dtús, agus cinntigh go bhfuil an suíomh cumasaithe
uk: Спочатку виберіть станцію або транспортний засіб та переконайтеся, що місце розташування включено

source: Could not get directions
ga: Níorbh fhéidir treoracha a fháil
uk: Не вдалося отримати напрямки

source: Could not process directions
ga: Níorbh fhéidir treoracha a phróiseáil
uk: Не вдалося обробити напрямки

source: Address
ga: Tabhair faoi
uk: Адреса

source: Distance
ga: Téigh chun cinn ar
uk: Відстань

source: meters
ga: méadar
uk: метри

source: Estimated Time
ga: Am measta
uk: Орієнтовний час

source: minutes
ga: nóiméad
uk: хвилини

source: Start
ga: Cuir ar siúl
uk: Почати

source: Pause
ga: Cúis
uk: Пауза

source: Finish
ga: Bailchríoch
uk: Закінчити

source: Resume
ga: Atosaigh
uk: Відновити

source: Trip finished
ga: Turas críochnaithe
uk: Поїздка закінчена

source: Loading
ga: Lódáil
uk: Завантаження

source: Start error
ga: Earráid Tosaigh
uk: Початкова помилка

source: Network error starting trip
ga: Earráid líonra ag tosú turas
uk: Помилка мережі Початок поїздки

source: Pause error
ga: Earráid sos
uk: Помилка паузи

source: Network error pausing trip.
ga: Earráid líonra ag stopadh turas.
uk: Помилка мережі призупиняє поїздку.

source: Resume error
ga: Atosú earráid
uk: Помилка резюме

source: Network error resuming trip.
ga: Earráid líonra ag dul ar ais ar an turas.
uk: Помилка мережі Відновлює поїздку.

source: Are you sure you want to end the current trip?
ga: An bhfuil tú cinnte gur mhaith leat deireadh a chur leis an turas reatha?
uk: Ви впевнені, що хочете закінчити поточну поїздку?

source: End error
ga: Deireadh earráid
uk: Кінцева помилка

source: Network error ending trip
ga: Earráid líonra ag críochnú turas
uk: Мережева помилка, що закінчується поїздкою

source: Leave a Review
ga: Fág léirmheas
uk: Залишити відгук

source: Write your review...
ga: Scríobh d’athbhreithniú ...
uk: Напишіть свій відгук ...

source: Submit
ga: Cuir isteach
uk: Надіслати

source: Close
ga: Críoch a chur le
uk: Закрити

source: Please write a review before submitting.
ga: Scríobh athbhreithniú le do thoil sula gcuirfear isteach é.
uk: Будь ласка, напишіть відгук перед поданням.

source: Thank you for your review!
ga: Go raibh maith agat as do léirmheas!
uk: Дякуємо за відгук!

source: Error submitting review. Please try again.
ga: Earráid ag cur isteach Athbhreithniú.Bain triail eile as.
uk: Помилка подання огляду.Будь ласка, спробуйте ще раз.

source: Failed to send message. Connection might be down.
ga: Theip ar theachtaireacht a sheoladh.D'fhéadfadh nasc a bheith síos.
uk: Не вдалося надіслати повідомлення.Зв'язок може бути вниз.

source: Error: Chat ID is missing.
ga: Earráid: Tá ID comhrá ar iarraidh.
uk: Помилка: ідентифікатор чату відсутній.

source: Switch to light theme
ga: Athraigh go téama éadrom
uk: Перейти на світлу тему

source: Switch to dark theme
ga: Athraigh go téama dorcha
uk: Перейти на темну тему

source: Disable Accessibility Mode
ga: Mód Inrochtaineachta a dhíchumasú
uk: Вимкнути режим доступності

source: Enable Accessibility Mode
ga: Cumasaigh Mód Inrochtaineachta
uk: Увімкнути режим доступності

source: Timer Sync Error
ga: Earráid Sync Timer
uk: Помилка синхронізації таймера

source: Trip in progress
ga: Turas ar siúl
uk: Поїздка в процесі

source: Connecting
ga: Ceangail
uk: З'єднання

source: Connected
ga: Nasctha
uk: З'єднаний

source: Paused
ga: Sosaithe
uk: Призупинений

source: No current trip
ga: Gan aon turas reatha
uk: Немає поточної поїздки

source: Trip not started
ga: Ní thosaigh an turas
uk: Поїздка не розпочалася

source: Trip status: Unknown
ga: Stádas turais: anaithnid
uk: Статус поїздки: Невідомий

source: New Message
ga: Teachtaireacht nua
uk: Нове повідомлення

source: Click to view
ga: Cliceáil chun féachaint air
uk: Клацніть, щоб переглянути

source: You've unlocked a new
ga: Díghlasáil tú nua
uk: Ви розблокували нове

source: Cashback
ga: Aisairgead
uk: Повернення коштів

source: Rent
ga: Cíos

source: km
uk: км
