Repository: Cursyy/GoRide
Catalog: django/locale/*/LC_MESSAGES/django.po
Languages: ga

source: Profile
ga: Cuir i bpróifíl

source: Profile Picture
ga: Pictiúr próifíle

source: Edit Profile
ga: Próifíl eagarthóireachta

source: Email
ga: Ríomhphost a chur

source: Phone
ga: Glao gutháin a chur ar

source: No achievements yet. Keep riding!
ga: Gan aon éachtaí fós.Coinnigh marcaíocht!

source: Statistics
ga: Staidreamh

source: Total Rides:
ga: Rides Iomlán:

source: Total Hours:
ga: Uaireanta Iomlán:

source: Total Spent:
ga: Iomlán caite:

source: Most Used Vehicle:
ga: Feithicil is mó a úsáidtear:

source: No statistics available.
ga: Níl aon staitisticí ar fáil.

source: Subscription
ga: Síntiús

source: Start date
ga: Dáta tosaithe

source: End date
ga: Dáta deiridh

source: You have no active subscriptions
ga: Níl aon síntiúis ghníomhacha agat

source: Choose plan
ga: Roghnaigh plean

source: Balance
ga: Cothromaigh

source: Top up
ga: Bunstaisigh

source: Background image
ga: Íomhá chúlra

source: Avatar image
ga: Íomhá Avatar

source: Shirt image
ga: Íomhá léine

source: Hat image
ga: Íomhá hata

source: Accessory image
ga: Íomhá ghabhálas

source: Hats
ga: Hataí

source: Unlock by
ga: Díghlasáil le

source: Shirts
ga: Léinte

source: Accessories
ga: Gabh gabhálais

source: Backgrounds
ga: Cúlra

source: Username
ga: Ainm úsáideora

source: Phone Number
ga: Uimhir ghutháin

source: Save Changes
ga: Athruithe a shábháil

source: Email sent
ga: Ríomhphost seolta

source: Email Sent
ga: Ríomhphost seolta

source: A confirmation email has been sent to your email address. Please check your inbox (and spam folder) to confirm your account.
ga: Tá ríomhphost dearbhaithe curtha chuig do sheoladh ríomhphoist.Seiceáil do bhosca isteach (agus an fillteán spam) le do thoil chun do chuntas a dheimhniú.

source: Back to Home
ga: Ar ais ar an mbaile

source: Login
ga: Logáil isteach

source: Login or Create a New Account
ga: Logáil isteach nó cruthaigh cuntas nua

source: New Customer?
ga: Custaiméir nua?

source: Create New Account
ga: Cuntas nua a chruthú

source: Registered Customers Only
ga: Custaiméirí cláraithe amháin

source: Forgot your password?
ga: An ndearna tú dearmad ar do phasfhocal?

source: Password Changed
ga: Athraíodh pasfhocal

source: Password Changed Successfully
ga: D'athraigh pasfhocal go rathúil

source: Your password has been updated successfully.
ga: Rinneadh do phasfhocal a nuashonrú go rathúil.

source: Return to Homepage
ga: Filleadh ar an leathanach baile

source: Change Password
ga: Athraigh pasfhocal

source: Change Your Password
ga: Athraigh do phasfhocal

source: Secure Your Account
ga: Faigh do chuntas

source: Enter your current password and choose a new one.
ga: Iontráil do phasfhocal reatha agus roghnaigh ceann nua.

source: Password Reset Complete
ga: Athshocraigh Pasfhocal Comhlánaigh

source: Password Reset Successful
ga: Athshocraigh pasfhocal rathúil

source: Your password has been reset successfully.
ga: Athshocraigh do phasfhocal go rathúil.

source: Set a New Password
ga: Socraigh pasfhocal nua

source: Create a New Password
ga: Cruthaigh pasfhocal nua

source: Enter your new password below.
ga: Iontráil do phasfhocal nua thíos.

source: Check Your Email
ga: Seiceáil do r -phost

source: If an account exists with the email you entered, you will receive a password reset link.
ga: Má tá cuntas ann leis an ríomhphost a chuir tú isteach, gheobhaidh tú nasc athshocraithe pasfhocal.

source: Back to Login
ga: Ar ais chuig Logáil Isteach

source: Reset Password
ga: Pasfhocal athshocraithe

source: Forgot Your Password?
ga: An ndearna tú dearmad ar do phasfhocal?

source: Reset Your Password
ga: Athshocraigh do phasfhocal

source: Enter your email, and we’ll send you a link to reset your password.
ga: Cuir isteach do r -phost, agus seolfaimid nasc chugat chun do phasfhocal a athshocrú.

source: Send Reset Link
ga: Seol nasc athshocraithe

source: Create a New Account
ga: Cruthaigh cuntas nua

source: Already have an account?
ga: An bhfuil cuntas agat cheana féin?

source: Enter the following information to create a new account.
ga: Cuir isteach an fhaisnéis seo a leanas chun cuntas nua a chruthú.

source: Register Account
ga: Cuntas cláraithe

source: Complete %(value)s rides
ga: Turais iomlána %(value)s

source: Complete %(value)s bike rides
ga: Turais rothar iomlán %(value)s

source: Complete %(value)s scooter rides
ga: Críochnaigh %(value)s turais scútar

source: Spend %(value)s hours riding
ga: Caith %(value)s uaireanta marcaíocht

source: Spend €%(value)s
ga: Caith €%(value)s

source: Unknown condition
ga: Coinníoll Anaithnid

source: Booking Successful
ga: Rathúil in áirithe

source: Booking Successful!
ga: Áirithint rathúil!

source: Thank you for booking with
ga: Go raibh maith agat as áirithint a dhéanamh leis

source: Your booking has been confirmed.
ga: Deimhníodh d’áirithint.

source: Return to Home
ga: Filleadh ar an mbaile

source: Find Your Way
ga: Faigh do bhealach

source: Rent
ga: Cíos

source: Price per hour
ga: Praghas in aghaidh na huaire

source: Total amount
ga: An méid iomlán

source: Your subscription
ga: Do shuibscríobh

source: Enter voucher code
ga: Iontráil cód dearbhán

source: Apply
ga: Feidhmigh

source: Number of Hours
ga: Líon uaireanta

source: Choose Payment Method
ga: Roghnaigh modh íocaíochta

source: Stripe
ga: Strácáil

source: Paypal
ga: Pá

source: Rent Now
ga: Cíos anois

source: Subscribe
ga: Suibscríobh

source: Subscribe to
ga: Liostáil le

source: Duration
ga: Fadfhad

source: Price
ga: Praghas a fháil amach

source: Proceed to Pay
ga: Lean ar aghaidh ag íoc

source: Top Up
ga: Bunstaisigh

source: Top up your wallet
ga: TOP SPORT do sparán

source: Current balance
ga: Cothromaíocht reatha

source: Top up amount
ga: Méid breise

source: Careers at GoRide
ga: Gairmeacha ag Goride

source: Join the GoRide Team!
ga: Bí ar an bhfoireann Goride!

source: We’re a small student startup with big dreams. Help us make urban travel greener and more fun!
ga: Is tosaithe mac léinn beag muid le brionglóidí móra.Cuidigh linn taisteal uirbeach a dhéanamh níos glaise agus níos mó spraoi!

source: Why Work With Us?
ga: Cén fáth a n -oibríonn muid linn?

source: GoRide was started by two Ukrainian students, Alex and Oleksandr, with a mission to transform urban mobility. We’re passionate about sustainability, innovation, and having a good time while we’re at it. Join us to be part of a fun, young team that’s making a real difference in Dublin!
ga: Thosaigh beirt mhac léinn Úcráinis, Alex agus Oleksandr, Goride, le misean chun soghluaisteacht uirbeach a athrú.Táimid an -bhródúil as inbhuanaitheacht, nuálaíocht, agus am maith a bheith againn agus muid ag obair.Bí linn le bheith mar chuid d'fhoireann spraoi, óg atá ag déanamh fíordhifríochta i mBaile Átha Cliath!

source: We might be small now, but we’re dreaming big. If you love tech, green solutions, or just want to work with two guys who code while eating borscht, we’d love to hear from you!
ga: D'fhéadfaimis a bheith beag anois, ach táimid ag brionglóid mhór.Má tá grá agat do theicneolaíocht, réitigh ghlasa, nó más mian leat a bheith ag obair le beirt fhear a chód agus tú ag ithe borscht, ba bhreá linn cloisteáil uait!

source: Apply Now
ga: Iarratas a dhéanamh anois

source: First Name
ga: Céadainm

source: Last Name
ga: An t -ainm deireanach

source: Email Address
ga: Seoladh ríomhphoist

source: Desired Position
ga: Seasamh inmhianaithe

source: Tell Us About Yourself
ga: Inis dúinn fút féin

source: Upload Resume (optional)
ga: Uaslódáil atosú (roghnach)

source: Submit Application
ga: Iarratas a chur isteach

source: Ready to Make a Difference?
ga: Réidh chun difríocht a dhéanamh?

source: We can’t wait to meet you! Submit your application, and let’s build a greener future together.
ga: Ní féidir linn fanacht le bualadh leat!Cuir isteach d'iarratas, agus déanaimis todhchaí níos glaise a thógáil le chéile.

source: Thank You for Applying!
ga: Go raibh maith agat as iarratas a dhéanamh!

source: We’ve received your application and are super excited to learn more about you! Alex and Oleksandr will take a look soon – probably over a bowl of borscht. We’ll get back to you as soon as we can.
ga: Tá d'iarratas faighte againn agus táimid an -tógtha le níos mó a fhoghlaim fút!Beidh Alex agus Oleksandr ag breathnú go luath - is dócha thar bhabhla Borscht.Rachaimid ar ais chugat chomh luath agus is féidir linn.

source: Explore GoRide While You Wait
ga: Déan iniúchadh ar Goride agus tú ag fanacht

source: Why not take a ride on one of our electric bikes or scooters? It’s the best way to get around Dublin!
ga: Cén fáth nach dtógfaidh tú turas ar cheann dár rothair nó scútair leictreacha?Is é an bealach is fearr chun dul timpeall ar Bhaile Átha Cliath!

source: Start Riding Now
ga: Tosaigh ag marcaíocht anois

source: {editor}: Editing failed
ga: {editor}: Theip ar editoreacht

source: {editor}: Editing failed: {e}
ga: {editor}: Theip ar eagarthóireacht: {e}

source: Aborted!
ga: Gorm!

source: (Deprecated) {text}
ga: (Dímheas) {text}

source: Options
ga: Roghanna

source: DeprecationWarning: The command {name!r} is deprecated.
ga: Dímheasúnú: Tá an t -ordú {name!r} neamhchoitianta.

source: Commands
ga: Ord

source: Missing command.
ga: Ordú ar iarraidh.

source: No such command {name!r}.
ga: Níl aon ordú den sórt sin {name!r}.

source: Value must be an iterable.
ga: Ní mór go mbeadh luach in ann a bheith in ann.

source: (dynamic)
ga: (dinimiciúil)

source: default: {default}
ga: Réamhshocrú: {default}

source: required
ga: gá

source: %(prog)s, version %(version)s
ga: %(prog)s, leagan %(version)s

source: Show the version and exit.
ga: Taispeáin an leagan agus an bealach amach.

source: Show this message and exit.
ga: Taispeáin an teachtaireacht seo agus an bealach amach.

source: Error: {message}
ga: Earráid: {message}

source: Try '{command} {option}' for help.
ga: Bain triail as '{command} {option}' chun cabhair a fháil.

source: Invalid value: {message}
ga: Luach neamhbhailí: {message}

source: Invalid value for {param_hint}: {message}
ga: Luach neamhbhailí do {param_hint}: {message}

source: Missing argument
ga: Argóint ar iarraidh

source: Missing option
ga: Rogha atá ar iarraidh

source: Missing parameter
ga: Paraiméadar ar iarraidh

source: Missing {param_type}
ga: Ar iarraidh {param_type}

source: Missing parameter: {param_name}
ga: Paraiméadar ar iarraidh: {param_name}

source: No such option: {name}
ga: Gan aon rogha den sórt sin: {name}

source: unknown error
ga: Earráid anaithnid

source: Could not open file {filename!r}: {message}
ga: Níorbh fhéidir an comhad {filename!r} a oscailt: {message}

source: Usage:
ga: Úsáid:

source: Argument {name!r} takes {nargs} values.
ga: Glacann argóint {name!r} luachanna {nargs}.

source: Option {name!r} does not take a value.
ga: Ní ghlacann rogha {name!r} luach.

source: Shell completion is not supported for Bash versions older than 4.4.
ga: Ní thacaítear le críochnú na mblaosc do leaganacha Bash níos sine ná 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
ga: Níorbh fhéidir leagan Bash a bhrath, ní thacaítear le críochnú na mblaosc.

source: Repeat for confirmation
ga: Déan arís le haghaidh deimhnithe

source: Error: The value you entered was invalid.
ga: Earráid: Bhí an luach a chuir tú isteach neamhbhailí.

source: Error: {e.message}
ga: Earráid: {e.message}

source: Error: The two entered values do not match.
ga: Earráid: Ní mheaitseálann an dá luach iontráilte.

source: Error: invalid input
ga: Earráid: Ionchur neamhbhailí

source: Press any key to continue...
ga: Brúigh aon eochair chun leanúint ar aghaidh ...

source: Choose from: {choices}
ga: Roghnaigh ó: {choices}

source: {value!r} is not a valid {number_type}.
ga: {value!r} Níl sé bailí {number_type}.

source: {value} is not in the range {range}.
ga: Níl {value} sa raon {range}.

source: {value!r} is not a valid boolean.
ga: {value!r} Ní boolean bailí é.

source: {value!r} is not a valid UUID.
ga: {value!r} Ní UUID bailí é.

source: file
ga: comhad

source: directory
ga: eolaire

source: path
ga: cosú

source: {name} {filename!r} does not exist.
ga: {name} {filename!r} Níl ann.

source: {name} {filename!r} is a file.
ga: Is comhad é {name} {filename!r}.

source: {name} {filename!r} is a directory.
ga: Is eolaire é {name} {filename!r}.

source: {name} {filename!r} is not readable.
ga: Níl {name} {filename!r} inléite.

source: {name} {filename!r} is not writable.
ga: {ainm} {filename!r} Níl sé inscríofa.

source: {name} {filename!r} is not executable.
ga: Níl {name} {filename!r} inrite.

source: Messages
ga: Blas

source: Site Maps
ga: Léarscáileanna suímh

source: Static Files
ga: Comhaid statacha

source: Syndication
ga: Sinsectication

source: That page number is not an integer
ga: Ní slánuimhir é an uimhir leathanaigh sin

source: That page number is less than 1
ga: Tá an uimhir leathanaigh sin níos lú ná 1

source: That page contains no results
ga: Níl aon torthaí sa leathanach sin

source: Enter a valid value.
ga: Iontráil luach bailí.

source: Enter a valid domain name.
ga: Cuir isteach ainm fearainn bailí.

source: Enter a valid URL.
ga: Iontráil URL bailí.

source: Enter a valid integer.
ga: Iontráil slánuimhir bhailí.

source: Enter a valid email address.
ga: Cuir isteach seoladh ríomhphoist bailí.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ga: Cuir isteach “seilide” bailí ina bhfuil litreacha, uimhreacha, béim nó fleiscín.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ga: Cuir isteach “seilide” bailí ina bhfuil litreacha, uimhreacha, béim, nó fleiscín unicode.

source: Enter a valid %(protocol)s address.
ga: Cuir isteach seoladh bailí %(protocol)s.

source: IPv4 or IPv6
ga: IPv4 nó IPv6

source: Enter only digits separated by commas.
ga: Cuir isteach ach digití atá scartha ag camóga.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ga: Cinntigh go bhfuil an luach seo %(limit_value)s (tá sé %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
ga: Cinntigh go bhfuil an luach seo níos lú ná nó cothrom le %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
ga: Cinntigh go bhfuil an luach seo níos mó ná nó cothrom le %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
ga: Cinntigh go bhfuil an luach seo iolrach de mhéid céim %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ga: Cinntigh go bhfuil an luach seo iolrach de mhéid céim %(limit_value)s, ag tosú ó %(offset)s, e.e.%(offset)s, %(valid_value1)s, %(valid_value2) s, agus mar sin de.

source: Enter a number.
ga: Iontráil uimhir.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
ga: Ní cheadaítear síneadh comhaid “%(extension)s”.Is iad na síntí ceadaithe ná: %(allowed_extensions)s.

source: Null characters are not allowed.
ga: Ní cheadaítear carachtair null.

source: and
ga: is

source: %(model_name)s with this %(field_labels)s already exists.
ga: %(model_name)s leis an %(field_labels)s ann cheana féin.

source: Constraint “%(name)s” is violated.
ga: Sáraítear srian “%(name)s”.

source: Value %(value)r is not a valid choice.
ga: Ní rogha bailí é luach %(value)r.

source: This field cannot be null.
ga: Ní féidir an réimse seo a bheith ar neamhní.

source: This field cannot be blank.
ga: Ní féidir leis an réimse seo a bheith folamh.

source: %(model_name)s with this %(field_label)s already exists.
ga: %(model_name)s leis an %(field_label)s ann cheana féin.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ga: %(field_label)s bheith uathúil do %(date_field_label)s %(lookup_type)s.

source: Field of type: %(field_type)s
ga: Réimse an chineáil: %(field_type) s

source: “%(value)s” value must be either True or False.
ga: Caithfidh luach “%(value)s” a bheith fíor nó bréagach.

source: “%(value)s” value must be either True, False, or None.
ga: Ní mór go mbeadh luach “%(value)s” fíor, bréagach, nó gan aon cheann.

source: Boolean (Either True or False)
ga: Boole (fíor nó bréagach)

source: String (up to %(max_length)s)
ga: Teaghrán (suas le %(max_length) s)

source: String (unlimited)
ga: Teaghrán (Neamhtheoranta)

source: Comma-separated integers
ga: Slánuimhreacha scartha camóga

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
ga: Tá formáid dáta neamhbhailí ag luach “%(value)s”.Caithfidh sé a bheith i bhformáid Yyyy-MM-DD.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
ga: Tá an fhormáid cheart ag luach “%(value)s” (yyyy-mm-dd) ach is dáta neamhbhailí é.

source: Date (without time)
ga: Dáta (gan am)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ga: Tá formáid neamhbhailí ag luach “%(value)s”.Caithfidh sé a bheith i bhformáid yyyy-mm-dd HH: mm [: ss [.uuuuuu]] [Tz].

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ga: Tá an fhormáid cheart ag luach “%(value)s” (yyyy-mm-dd: mm [: ss [.uuuuuu]] [TZ]) ach is dáta/am neamhbhailí é.

source: Date (with time)
ga: Dáta (le ham)

source: “%(value)s” value must be a decimal number.
ga: Caithfidh luach “%(value)s” a bheith ina uimhir deachúil.

source: Decimal number
ga: Uimhir deachúil

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ga: Tá formáid neamhbhailí ag luach “%(value)s”.Caithfidh sé a bheith i bhformáid [dd] [[hh:] mm:] ss [.uuuuuuu].

source: Email address
ga: Seoladh ríomhphoist

source: File path
ga: Cosán comhad

source: “%(value)s” value must be a float.
ga: Caithfidh luach “%(value)s” a bheith ina snámh.

source: Floating point number
ga: Uimhir phointe ar snámh

source: “%(value)s” value must be an integer.
ga: Ní mór go mbeadh luach “%(value)s” ina slánuimhir.

source: Integer
ga: Slánuimhir

source: Big (8 byte) integer
ga: Slánuimhir mhór (8 beart)

source: Small integer
ga: Slánuimhir bheag

source: IPv4 address
ga: Seoladh IPv4

source: IP address
ga: Seoladh IP

source: “%(value)s” value must be either None, True or False.
ga: Ní mór go mbeadh luach “%(value)s” ar aon cheann, fíor nó bréagach.

source: Boolean (Either True, False or None)
ga: Boole (fíor, bréagach nó gan aon cheann)

source: Positive big integer
ga: Slánuimhir mhór dhearfach

source: Positive integer
ga: Slánuimhir dhearfach

source: Positive small integer
ga: Slánuimhir bheag dhearfach

source: Slug (up to %(max_length)s)
ga: Slug (suas le %(max_length) s)

source: Text
ga: Téacs

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ga: Tá formáid neamhbhailí ag luach “%(value)s”.Caithfidh sé a bheith i bhformáid hh: mm [: ss [.uuuuuu]].

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ga: Tá an fhormáid cheart ag luach “%(value)s” (hh: mm [: ss [.uuuuuu]]) ach is am neamhbhailí é.

source: Time
ga: Am

source: Raw binary data
ga: Sonraí dénártha amh

source: “%(value)s” is not a valid UUID.
ga: Ní UUID bailí é “%(value)s”.

source: Universally unique identifier
ga: Aitheantóir uathúil go huilíoch

source: File
ga: Comhad

source: Image
ga: Íomhá

source: A JSON object
ga: Cuspóir JSON

source: Value must be valid JSON.
ga: Caithfidh luach a bheith bailí JSON.

source: %(model)s instance with %(field)s %(value)r does not exist.
ga: %(model)s gcás le %(field)s %(value)r ann.

source: Foreign Key (type determined by related field)
ga: Eochair eachtrach (cineál arna chinneadh ag an réimse gaolmhar)

source: One-to-one relationship
ga: Caidreamh duine le duine

source: %(from)s-%(to)s relationship
ga: %(from)s-%(to)s caidreamh

source: %(from)s-%(to)s relationships
ga: %(from)s-%(to)s caidrimh s

source: Many-to-many relationship
ga: Caidreamh go leor le go leor

source: This field is required.
ga: Teastaíonn an réimse seo.

source: Enter a whole number.
ga: Iontráil uimhir iomlán.

source: Enter a valid date.
ga: Iontráil dáta bailí.

source: Enter a valid time.
ga: Cuir isteach am bailí.

source: Enter a valid date/time.
ga: Iontráil dáta/am bailí.

source: Enter a valid duration.
ga: Iontráil ré bailí.

source: The number of days must be between {min_days} and {max_days}.
ga: Caithfidh líon na laethanta a bheith idir {min_days} agus {max_days}.

source: No file was submitted. Check the encoding type on the form.
ga: Níor cuireadh aon chomhad isteach.Seiceáil an cineál ionchódú ar an bhfoirm.

source: No file was submitted.
ga: Níor cuireadh aon chomhad isteach.

source: The submitted file is empty.
ga: Tá an comhad a chuirtear isteach folamh.

source: Please either submit a file or check the clear checkbox, not both.
ga: Cuir isteach comhad le do thoil nó seiceáil an ticbhosca soiléir, ní an dá rud.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ga: Uaslódáil íomhá bhailí.Ní íomhá ná íomhá truaillithe a bhí sa chomhad a uaslódáil tú.

source: Select a valid choice. %(value)s is not one of the available choices.
ga: Roghnaigh rogha bailí.Níl %(value)s ar cheann de na roghanna atá ar fáil.

source: Enter a list of values.
ga: Cuir isteach liosta luachanna.

source: Enter a complete value.
ga: Iontráil luach iomlán.

source: Enter a valid UUID.
ga: Iontráil UUID bailí.

source: Enter a valid JSON.
ga: Cuir isteach JSON bailí.

source: (Hidden field %(name)s) %(error)s
ga: (Réimse i bhfolach %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ga: Tá sonraí bainistíochta ar iarraidh nó tá cur isteach orthu.Réimsí ar iarraidh: %(field_names) s.B'fhéidir go mbeidh ort tuarascáil fabht a chomhdú má mhaireann an tsaincheist.

source: Order
ga: Éide

source: Delete
ga: Scrios amach

source: Please correct the duplicate data for %(field)s.
ga: Ceartaigh na sonraí dúblacha le haghaidh %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
ga: Ceartaigh na sonraí dúblacha le haghaidh %(field)s le do thoil, rud a chaithfidh a bheith uathúil.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ga: Ceartaigh na sonraí dúblacha le haghaidh %(field_name) s le do thoil a chaithfidh a bheith uathúil don %(lookup) s i %(date_field) s.

source: Please correct the duplicate values below.
ga: Ceartaigh na luachanna dúblacha thíos le do thoil.

source: The inline value did not match the parent instance.
ga: Ní raibh an luach inlíne comhoiriúnach leis an gcás tuismitheora.

source: Select a valid choice. That choice is not one of the available choices.
ga: Roghnaigh rogha bailí.Níl an rogha sin ar cheann de na roghanna atá ar fáil.

source: “%(pk)s” is not a valid value.
ga: Ní luach bailí é “%(pk)s”.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ga: Ní fhéadfaí %(datetime)s a léirmhíniú i gcrios ama %(current_timezone)s; D'fhéadfadh sé a bheith débhríoch nó b'fhéidir nach bhfuil sé ann.

source: Clear
ga: Glan amach

source: Currently
ga: Faoi láthair

source: Change
ga: Athrú

source: Unknown
ga: Anaithnid

source: Yes
ga: Tá

source: No
ga: Ar bith

source: yes,no,maybe
ga: Sea, níl, b’fhéidir

source: PM
ga: In.

source: AM
ga: Im

source: midnight
ga: meán oíche

source: noon
ga: an meán lae

source: Monday
ga: An Luan

source: Tuesday
ga: Dé Máirt

source: Wednesday
ga: An Chéadaoin
