Repository: Cursyy/GoRide
Catalog: django/locale/*/LC_MESSAGES/django.po
Languages: ga

source: Contact Us
ga: Déan teagmháil linn

source: Get in Touch with GoRide
ga: Téigh i dteagmháil le Goride

source: We're here to help. Find our details below or send us a message.
ga: Táimid anseo chun cabhrú leat.Faigh ár sonraí thíos nó seol teachtaireacht chugainn.

source: Scroll Down
ga: Scrollaigh síos

source: Our Main Office
ga: Ár bpríomhoifig

source: Monday - Friday: 9:00 AM - 6:00 PM
ga: Dé Luain - Dé hAoine: 9:00 AM - 6:00 PM

source: Send Us a Message
ga: Seol teachtaireacht chugainn

source: Name
ga: Ainmnigh

source: Subject
ga: Ceist

source: Message
ga: Gar

source: Send Message
ga: Seol teachtaireacht

source: Customer Support
ga: Tacaíocht custaiméirí

source: Need help with a rental, your account, or have any questions? Our team is ready to assist.
ga: Teastaíonn cabhair uait le cíos, le do chuntas, nó aon cheisteanna a bheith agat?Tá ár bhfoireann réidh le cuidiú.

source: Reach out for quick help:
ga: Reach amach le haghaidh cabhair thapa:

source: Our Team in Action
ga: Ár bhfoireann i mbun gnímh

source: About
ga: Thart ar

source: Careers
ga: Gairm bheatha

source: Locations
ga: Ionad

source: Events
ga: Ócáidí

source: Home
ga: Áit

source: Rentals
ga: Cíos

source: Plans
ga: Pleanáil

source: Contacts
ga: Tadhall

source: Admin Panel
ga: Painéal riaracháin

source: Logout
ga: Logáil amach

source: Sign Up
ga: Sínigh

source: Switch theme
ga: Téama lasc

source: Accessibility mode button
ga: Cnaipe Mód Inrochtaineachta

source: Connecting
ga: Ceangail

source: Manage
ga: Bainistiú a dhéanamh ar

source: Main page
ga: An leathanach is mó

source: Modern electric bikes and scooters for the sustainable urban explorer
ga: Rothair agus scútair leictreacha nua -aimseartha don Explorer Uirbeach Inbhuanaithe

source: GoRide offers a convenient, eco-friendly fleet of electric bikes and scooters available 24 hours to easily zip around the city.
ga: Tairgeann Goride cabhlach áisiúil, cairdiúil don chomhshaol de rothair leictreacha agus scútair atá ar fáil 24 uair an chloig chun zip a dhéanamh go héasca timpeall na cathrach.

source: City Transport
ga: Iompar cathrach

source: Sustainable commuting
ga: Comaitéireacht inbhuanaithe

source: Transforming urban transport
ga: Iompar uirbeach a athrú

source: GoRide provides eco-friendly electric scooter and bike rentals for convenient, smooth urban commuting. Founded in 2021 by green mobility advocates, our mission is to transform urban transportation through innovative zero-emission mobility solutions.
ga: Soláthraíonn Goride scútar leictreach agus cíosanna rothar atá neamhdhíobhálach don chomhshaol le haghaidh comaitéireacht áisiúil, réidh uirbeach.Bunaithe in 2021 ag Abhcóidí Soghluaisteachta Glas, is é ár misean iompar uirbeach a athrú trí réitigh shoghluaisteachta nuálaíocha nialais.

source: Our Services
ga: Ár Seirbhísí

source: Retro Poster
ga: Póstaer retro

source: Bike Parking
ga: Páirceáil rothar

source: Ride the Future with GoRide!
ga: Taistil an todhchaí le Goride!

source: Hop on our electric bikes and scooters and zip through the city with style, speed, and zero hassle!
ga: Buail ar ár rothair agus scútair leictreacha agus zip tríd an gcathair le stíl, luas, agus nialas hassle!

source: Rent in a Snap
ga: Cíos i Snap

source: Unlock your ride in seconds! Just scan a QR code or punch in a code in the GoRide app, and you're off to explore the city.
ga: Díghlasáil do thuras i soicindí!Just a scanadh cód QR nó punch i gcód san aip Goride, agus tá tú chun an chathair a iniúchadh.

source: Wallet-Friendly Vibes
ga: Vibes atá neamhdhíobhálach don sparán

source: Ride from just <strong>%(price)s</strong> or grab a subscription to save big. Pay your way, ride your day!
ga: Taisteal ó díreach <strong>%(price)s </strong> nó síntiús a ghreamú chun BIG a shábháil.Íoc do bhealach, marcaíocht ar do lá!

source: Park Anywhere, Anytime
ga: Páirceáil áit ar bith, am ar bith

source: Drop your ride at any of our <strong>%(stations)s stations</strong> across the city or park in designated zones. Freedom’s never been this easy!
ga: Buail do thiomána ag aon cheann dár stáisiúin <strong>%(stations)s stáisiúin </strong> ar fud na cathrach nó páirceáil i gcriosanna ainmnithe.Ní raibh an tsaoirse seo éasca riamh!

source: What People Are Saying About Us!
ga: Cad atá á rá ag daoine fúinn!

source: Previous
ga: Roimhe seo

source: Next
ga: Ar aghaidh

source: No reviews yet. Be the first to leave one!
ga: Gan aon athbhreithnithe fós.Bí ar an gcéad duine a fhágfaidh ceann!

source: See All Reviews
ga: Féach gach athbhreithniú

source: Discover Amazing Stats
ga: Faigh amach stats iontach

source: Total Users
ga: Úsáideoirí iomlána

source: Average raiting
ga: Meánráta

source: Completed Trips
ga: Turais Críochnaithe

source: Download the GoRide app and start riding
ga: Íoslódáil an aip Goride agus Tosaigh marcaíocht

source: With just a few taps, you can locate, unlock, and ride.
ga: Le cúpla sconnaí amháin, is féidir leat a aimsiú, a dhíghlasáil agus a thiomána.

source: Get Started
ga: Faigh Tosaigh

source: Stripe Payment for
ga: Íocaíocht stríoc do

source: Total Amount:
ga: Méid iomlán:

source: Pay with Stripe
ga: Íoc le stríoc

source: Payment for
ga: Íocaíocht le haghaidh

source: Pay
ga: Íoc

source: Payment Successful
ga: Íocaíocht rathúil

source: Thank you for your payment!
ga: Go raibh maith agat as d’íocaíocht!

source: Return to Transport
ga: Filleadh ar iompar

source: All Reviews
ga: Gach Léirmheasanna

source: First
ga: An chéad

source: Last
ga: Is deireanaí

source: Daily Subscription
ga: Síntiús laethúil

source: Weekly Subscription
ga: Síntiús seachtainiúil

source: Monthly Subscription
ga: Síntiús míosúil

source: Student
ga: Mac léinn

source: Athlete
ga: Lúthchleasaí

source: Choose a Subscription Plan
ga: Roghnaigh plean síntiúis

source: Price:
ga: Praghas:

source: Transport type:
ga: Cineál iompair:

source: Bike only
ga: Rothar amháin

source: All types available
ga: Gach cineál ar fáil

source: Subscription Successful
ga: Suibscríobh rathúil

source: Subscription Successful!
ga: Suibscríobh rathúil!

source: Your subscription has been activated.
ga: Tá do shuibscríobh curtha i ngníomh.

source: Return to Plans
ga: Filleadh ar phleananna

source: Admin Support Panel
ga: Painéal Tacaíochta Riaracháin

source: Active Chats
ga: Comhráite gníomhacha

source: No active chats
ga: Gan comhráite gníomhacha

source: Chat with
ga: Comhrá a dhéanamh le

source: No messages yet. Start the conversation!
ga: Gan teachtaireachtaí fós.Cuir tús leis an gcomhrá!

source: Send
ga: Cuir

source: Admin chat details
ga: Sonraí Comhrá Riaracháin

source: Reply to the chat:
ga: Freagra a thabhairt ar an gcomhrá:

source: Send Reply
ga: Seol freagra

source: Back to chat list
ga: Ar ais ar liosta comhrá

source: All chats
ga: Gach comhrá

source: Chat
ga: Comhrá a chomhraáil

source: No active chats.
ga: Gan comhráite gníomhacha.

source: Chat with Support
ga: Comhrá le tacaíocht

source: Chat History
ga: Stair comhrá
