Repository: Cursyy/GoRide
Catalog: django/locale/*/LC_MESSAGES/django.po
Languages: ga

source: Thursday
ga: Déardaoin

source: Friday
ga: An Aoine

source: Saturday
ga: An Satharn

source: Sunday
ga: An Domhnach

source: Mon
ga: Duine

source: Tue
ga: An

source: Wed
ga: Meon

source: Thu
ga: Thú

source: Fri
ga: Dé Aoine

source: Sat
ga: Suí

source: Sun
ga: Grian

source: January
ga: Mí Eanáir

source: February
ga: Mí Feabhra

source: March
ga: Mí an Mhárta

source: April
ga: Mí Aibreáin

source: May
ga: Ar mhiste leat?

source: June
ga: Mí an Mheithimh

source: July
ga: Mí Iúil

source: August
ga: Mí Lúnasa

source: September
ga: Mí Mheán Fómhair

source: October
ga: Deireadh Fómhair

source: November
ga: Mí na Samhna

source: December
ga: Mí na Nollag

source: jan
ga: Ean

source: feb
ga: mí Feabhra

source: apr
ga: an Aibreán

source: may
ga: ar mhiste leat?

source: jun
ga: ream

source: jul
ga: an Iúil

source: aug
ga: chomh fada

source: sep
ga: seip sin

source: oct
ga: in Deireadh Fómhair

source: nov
ga: Nochta

source: dec
ga: bonnbhonn

# abbrev. month
source: Jan.
ga: Eanáir.

# abbrev. month
source: Feb.
ga: Feabhra.

# abbrev. month
source: March
ga: Mí an Mhárta

# abbrev. month
source: April
ga: Mí Aibreáin

# abbrev. month
source: May
ga: Ar mhiste leat?

# abbrev. month
source: June
ga: Mí an Mheithimh

# abbrev. month
source: July
ga: Mí Iúil

# abbrev. month
source: Aug.
ga: Lúnasa.

# abbrev. month
source: Sept.
ga: Meán Fómhair.

# abbrev. month
source: Oct.
ga: Deireadh Fómhair.

# abbrev. month
source: Nov.
ga: Samhain.

# abbrev. month
source: Dec.
ga: Nollaig.

# alt. month
source: January
ga: Mí Eanáir

# alt. month
source: February
ga: Mí Feabhra

# alt. month
source: March
ga: Mí an Mhárta

# alt. month
source: April
ga: Mí Aibreáin

# alt. month
source: May
ga: Ar mhiste leat?

# alt. month
source: June
ga: Mí an Mheithimh

# alt. month
source: July
ga: Mí Iúil

# alt. month
source: August
ga: Mí Lúnasa

# alt. month
source: September
ga: Mí Mheán Fómhair

# alt. month
source: October
ga: Deireadh Fómhair

# alt. month
source: November
ga: Mí na Samhna

# alt. month
source: December
ga: Mí na Nollag

source: This is not a valid IPv6 address.
ga: Ní seoladh bailí IPv6 é seo.

source: or
ga: nó

source: Forbidden
ga: Toirmiscilte

source: CSRF verification failed. Request aborted.
ga: Theip ar fhíorú CSRF.Iarratas ar a.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ga: Tá an teachtaireacht seo á fheiceáil agat mar go n -éilíonn an suíomh HTTPS seo “ceanntásc Reisire” le seoladh ag do bhrabhsálaí gréasáin, ach níor seoladh aon cheann.Tá an ceanntásc seo ag teastáil ar chúiseanna slándála, chun a chinntiú nach bhfuil tríú páirtithe ag fuadach do bhrabhsálaí.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ga: Má tá do bhrabhsálaí cumraithe agat chun ceanntásca “Radharc” a dhíchumasú, déan iad a athchumasú le do thoil, ar a laghad don láithreán seo, nó do naisc HTTPS, nó le haghaidh iarratais “tionscnaimh chéanna”.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ga: Má tá tú ag baint úsáide as an <meta name = "Refriter" Content = "No-Referrer"> nó an ceanntásc “Policy Policy: No-Referrer” san áireamh, bain iad le do thoil.Éilíonn an chosaint CSRF go ndéanfadh an ceanntásc “Refarter” seiceáil dhian -remerter.Má tá imní ort faoi phríobháideacht, bain úsáid as roghanna eile cosúil le <a rel = "noreferrer"…> le haghaidh naisc le suíomhanna tríú páirtí.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ga: Tá an teachtaireacht seo á fheiceáil agat mar go n -éilíonn an suíomh seo fianán CSRF agus foirmeacha á gcur isteach.Tá an fianán seo ag teastáil ar chúiseanna slándála, chun a chinntiú nach bhfuil tríú páirtithe ag fuadach do bhrabhsálaí.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ga: Má tá do bhrabhsálaí cumraithe agat chun fianáin a dhíchumasú, le do thoil iad a athchumasú, ar a laghad don láithreán seo, nó le haghaidh iarratais “tionscnaimh chéanna”.

source: More information is available with DEBUG=True.
ga: Tá tuilleadh eolais ar fáil le dífhabhtaithe = fíor.

source: No year specified
ga: Níl aon bhliain sonraithe

source: Date out of range
ga: Dáta as raon

source: No month specified
ga: Gan aon mhí sonraithe

source: No day specified
ga: Aon lá sonraithe

source: No week specified
ga: Gan aon seachtain sonraithe

source: No %(verbose_name_plural)s available
ga: Níl %(verbose_name_plural) s ar fáil

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ga: Níl an todhchaí %(verbose_name_plural)s ar fáil mar gheall go bhfuil %(class_name)s.allow_future bréagach.

source: Invalid date string “%(datestr)s” given format “%(format)s”
ga: Teaghrán Dáta Neamhbhailí “%(datestr)s” formáid “%(format)s”

source: No %(verbose_name)s found matching the query
ga: Ní bhfuarthas aon %(verbose_name) s ag meaitseáil an cheist

source: Page is not “last”, nor can it be converted to an int.
ga: Níl an leathanach “deireanach”, ná ní féidir é a thiontú go int.

source: Invalid page (%(page_number)s): %(message)s
ga: Leathanach neamhbhailí ( %(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
ga: Tá an liosta folamh agus “%(class_name)s.allow_empty” bréagach.

source: Directory indexes are not allowed here.
ga: Ní cheadaítear innéacsanna eolaire anseo.

source: “%(path)s” does not exist
ga: Níl “%(path)s” ann

source: Index of %(directory)s
ga: Innéacs %(directory)s

source: The install worked successfully! Congratulations!
ga: D'oibrigh an suiteáil go rathúil!Comhghairdeas!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ga: Féach ar <a href = View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s

source: Django Documentation
ga: Doiciméadú Django

source: Topics, references, &amp; how-to’s
ga: Topaicí, tagairtí, agus amp;Conas a's

source: Tutorial: A Polling App
ga: Teagaisc: Aip vótaíochta

source: Get started with Django
ga: Tosaigh le Django

source: Django Community
ga: Pobal django

source: Connect, get help, or contribute
ga: Ceangail, faigh cabhair, nó rannchuidiú

source: Attempting to connect to qpid with SASL mechanism %s
ga: Ag iarraidh ceangal le QPID le meicníocht SASL %s

source: Connected to qpid with SASL mechanism %s
ga: Ceangailte le QPID le meicníocht SASL %s

source: Unable to connect to qpid with SASL mechanism %s
ga: Ní féidir ceangal le QPID le meicníocht SASL %s

source: United States of America
ga: Stáit Aontaithe Mheiriceá i Meiriceá

source: Canada
ga: Ceanada

source: Afghanistan
ga: An Afganastáin

source: Albania
ga: An Albáin

source: Algeria
ga: An Ailgéir

source: American Samoa
ga: Samó Meiriceánach

source: Andorra
ga: Andóra

source: Angola
ga: Angóla

source: Anguilla
ga: Angise

source: Antarctica
ga: Antartaice

source: Antigua & Barbuda
ga: Antigua & Barbúda

source: Argentina
ga: An Airgintín

source: Armenia
ga: An Airméin

source: Australia
ga: An Astráil

source: Austria
ga: An Ostair

source: Azerbaijan
ga: An Asarbaiseáin

source: Bahama
ga: Bahámá

source: Bahrain
ga: Bairéin

source: Bangladesh
ga: An Bhanglaidéis

source: Barbados
ga: Barbadós

source: Belarus
ga: An Bhealarúis

source: Belgium
ga: An Bheilg

source: Belize
ga: An Bheilís

source: Benin
ga: Beinin

source: Bermuda
ga: Beirmiúda

source: Bhutan
ga: An Bhútáin

source: Bolivia
ga: An Bholaiv

source: Bosnia and Herzegovina
ga: An Bhoisnia agus Heirseagaivéin

source: Botswana
ga: An Bhotsuáin

source: Bouvet Island
ga: Bouvet

source: Brazil
ga: An Bhrasaíl

source: British Indian Ocean Territory
ga: Críoch Aigéan Indiach na Breataine

source: British Virgin Islands
ga: Oileáin Mhaighdean na Breataine

source: Bulgaria
ga: An Bhulgáir

source: Burkina Faso
ga: Buircíne Fasó

source: Burundi
ga: An Bhurúin

source: Cambodia
ga: An Chambóid

source: Cameroon
ga: Camarún

source: Cape Verde
ga: Rinn Verde

source: Cayman Islands
ga: Oileáin Cayman

source: Central African Republic
ga: Poblacht na hAfraice Láir

source: Chad
ga: Sead

source: Chile
ga: An tSile

source: China
ga: Poirceallán

source: Christmas Island
ga: Oileán na Nollag

source: Cocos (Keeling) Islands
ga: Oileáin Cocos (Keeling)

source: Colombia
ga: An Cholóim

source: Congo
ga: An Congó

source: Cook Iislands
ga: Oileáin Cócaireachta

source: Costa Rica
ga: Cósta Ríce

source: Croatia
ga: An Chróit

source: Cuba
ga: Cúba

source: Cyprus
ga: An Chipir

source: Czech Republic
ga: Poblacht na Seice

source: Denmark
ga: An Danmhairg

source: Dominica
ga: Doiminice

source: Dominican Republic
ga: Poblacht Dhoiminiceach

source: East Timor
ga: Tíomór Thoir

source: Ecuador
ga: Eacuadór

source: Egypt
ga: An Éigipt

source: El Salvador
ga: An tSalvadóir

source: Equatorial Guinea
ga: Guine batearach

source: Eritrea
ga: An Eiritré

source: Estonia
ga: An Eastóin

source: Ethiopia
ga: An Aetóip

source: Falkland Islands (Malvinas)
ga: Oileáin Fháclainne (Malvinas)

source: Faroe Islands
ga: Oileáin Fharó

source: Fiji
ga: Fidsí

source: Finland
ga: An Fhionlainn

source: France
ga: An Fhrainc

source: France, Metropolitan
ga: An Fhrainc, Metropolitan

source: French Guiana
ga: Guáin na Fraince

source: French Polynesia
ga: Polainéis na Fraince

source: French Southern Territories
ga: Críocha an Deiscirt Fraincise

source: Gabon
ga: An Ghabúin

source: Gambia
ga: An Ghaimbia

source: Georgia
ga: An tSeoirsia

source: Germany
ga: An Ghearmáin

source: Ghana
ga: Gána

source: Gibraltar
ga: (De chuid) na nGiobrálta

source: Greece
ga: An Ghréig

source: Greenland
ga: An Ghraonlainn

source: Grenada
ga: Greanáda

source: Guadeloupe
ga: Guahadalúip

source: Guatemala
ga: Guatamala

source: Guinea
ga: An Ghuine

source: Guinea-Bissau
ga: Guine Bissau

source: Guyana
ga: An Ghuáin

source: Haiti
ga: Háítí

source: Heard & McDonald Islands
ga: Oileáin Heard & McDonald

source: Honduras
ga: Hondúras

source: Hong Kong
ga: Hong Cong

source: Hungary
ga: An Ungáir

source: Iceland
ga: An Íoslainn

source: India
ga: An India

source: Indonesia
ga: An Indinéis

source: Iraq
ga: An Iaráic

source: Ireland
ga: Éire

source: Islamic Republic of Iran
ga: Poblacht Ioslamach na hIaráine

source: Israel
ga: Iosrael

source: Italy
ga: An Iodáil

source: Ivory Coast
ga: Cósta Eabhair

source: Jamaica
ga: Iamáice

source: Japan
ga: An tSeapáin

source: Jordan
ga: An Iordáin

source: Kazakhstan
ga: An Chasacstáin

source: Kenya
ga: An Chéinia

source: Korea, Democratic People's Republic of
ga: An Chóiré, Poblacht na nDaoine Daonlathach de

source: Korea, Republic of
ga: An Chóiré, Poblacht na

source: Kuwait
ga: Cuáit

source: Kyrgyzstan
ga: An Chirgeastáin

source: Lao People's Democratic Republic
ga: Poblacht Dhaonlathach Lao People

source: Latvia
ga: An Laitvia

source: Lebanon
ga: An Liobáin

source: Lesotho
ga: Leosóta

source: Liberia
ga: An Libéir

source: Libyan Arab Jamahiriya
ga: Jamahiriya Arabach Libyan Libyan

source: Liechtenstein
ga: Lichtinstéin

source: Lithuania
ga: An Liotuáin

source: Luxembourg
ga: Lucsamburg

source: Macau
ga: Marain

source: Malawi
ga: An Mhaláiv

source: Malaysia
ga: An Mhalaeisia

source: Maldives
ga: Oileáin Mhaildíve

source: Mali
ga: Mailí

source: Malta
ga: Málta

source: Marshall Islands
ga: Oileáin Marshall

source: Mauritania
ga: An Mháratáin

source: Mauritius
ga: Oileán Mhuirís

source: Mayotte
ga: Múibhheit

source: Mexico
ga: Meicsiceo

source: Micronesia
ga: An Mhicrinéis

source: Moldova, Republic of
ga: An Mholdóiv, Poblacht na

source: Monaco
ga: Monacó

source: Mongolia
ga: An Mhongóil

source: Morocco
ga: Maracó

source: Mozambique
ga: Mósaimbíc

source: Myanmar
ga: Maenmar

source: Namibia
ga: An Namaib

source: Nauru
ga: Nárús

source: Nepal
ga: Neipeal

source: Netherlands
ga: Ísiltír

source: Netherlands Antilles
ga: Aintillí na hÍsiltíre

source: New Caledonia
ga: An Nua -Chaladóin

source: New Zealand
ga: An Nua -Shéalainn

source: Nicaragua
ga: Nicearagua

source: Niger
ga: An Nígir

source: Nigeria
ga: An Nigéir

source: Norfolk Island
ga: Oileán Norfolk

source: Northern Mariana Islands
ga: Oileáin Mariana Thuaidh

source: Norway
ga: An Iorua

source: Oman
ga: Óman

source: Pakistan
ga: An Phacastáin

source: Papua New Guinea
ga: Nua -Ghuine Phapua

source: Paraguay
ga: Paragua

source: Peru
ga: Peiriú

source: Philippines
ga: Na hOileáin Dhuige

source: Pitcairn
ga: Pollcairtí

source: Poland
ga: An Pholainn

source: Portugal
ga: An Phortaingéil

source: Puerto Rico
ga: Pórtó Ríce

source: Qatar
ga: Catar

source: Reunion
ga: Athaontú

source: Romania
ga: An Rómáin

source: Russian Federation
ga: Cónaidhm na Rúise

source: Rwanda
ga: Ruanda

source: Saint Lucia
ga: Naomh Lucia

source: Samoa
ga: Samó

source: San Marino
ga: San Mairíne

source: Saudi Arabia
ga: An Araib Shádach

source: Senegal
ga: An tSeineagáil

source: Seychelles
ga: Séiséil

source: Sierra Leone
ga: Siarra Leon

source: Singapore
ga: Singeapór

source: Slovakia
ga: An tSlóvaic

source: Slovenia
ga: An tSlóivéin

source: Solomon Islands
ga: Oileáin Sholomón

source: Somalia
ga: An tSomáil

source: South Africa
ga: An Afraic Theas

source: South Georgia and the South Sandwich Islands
ga: An tSeoirsia Theas agus na hOileáin Sandwich Theas

source: Spain
ga: An Spáinn

source: Sri Lanka
ga: Srí Lanca

source: St. Helena
ga: Naomh Helena

source: St. Kitts and Nevis
ga: Naomh Kitts agus Nevis

source: St. Pierre & Miquelon
ga: Naomh Pierre & Miquelon

source: St. Vincent & the Grenadines
ga: Naomh Uinseann & na Grenadines

source: Sudan
ga: An tSúdáin

source: Suriname
ga: Suranam

source: Svalbard & Jan Mayen Islands
ga: Oileáin Svalbard & Jan Mayen

source: Swaziland
ga: An tSuasalainn

source: Sweden
ga: An tSualainn

source: Switzerland
ga: An Eilvéis

source: Syrian Arab Republic
ga: Poblacht Arabach na Siria

source: Taiwan, Province of China
ga: Taiwan, Cúige na Síne

source: Tajikistan
ga: An Táidsíceastáin

source: Tanzania, United Republic of
ga: An Tansáin, Poblacht Aontaithe na

source: Thailand
ga: An Téalainn

source: Togo
ga: Tóga

source: Trinidad & Tobago
ga: Oileán na Tríonóide & Tobága

source: Tunisia
ga: An Túinéis

source: Turkey
ga: An Tuirc

source: Turkmenistan
ga: An Tuircméanastáin

source: Turks & Caicos Islands
ga: Oileáin na dTurcach & Caicos

source: Tuvalu
ga: Túvalú

source: Ukraine
ga: An Úcráin

source: United Arab Emirates
ga: Aontas na nÉimíríochtaí Arabacha

source: United Kingdom (Great Britain)
ga: An Ríocht Aontaithe (an Bhreatain Mhór)

source: United States Minor Outlying Islands
ga: Oileáin mhion -imeallacha na Stát Aontaithe

source: United States Virgin Islands
ga: Oileáin Mhaighdean na Stát Aontaithe

source: Unknown or unspecified country
ga: Tír anaithnid nó neamhshonraithe

source: Uruguay
ga: Uragua

source: Uzbekistan
ga: An Úisbéiceastáin

source: Vanuatu
ga: Vanuatú

source: Vatican City State (Holy See)
ga: Stát Cathrach na Vatacáine (See Naofa)

source: Venezuela
ga: Veiniséala

source: Wallis & Futuna Islands
ga: Oileáin Wallis & Futuna

source: Western Sahara
ga: Sahára an Iarthair

source: Yemen
ga: Éimin

source: Yugoslavia
ga: An Iúgslaiv

source: Zaire
ga: An tSaír

source: Zambia
ga: An tSaimbia

source: Zimbabwe
ga: An tSiombáib

source: Street Address
ga: Seoladh sráide

source: City
ga: Cathair

source: State
ga: Staid

source: Country
ga: Tuath

source: Postal / Zip Code
ga: Cód poist / zip

source: Credit Card Number
ga: Uimhir chárta creidmheasa

source: Expiration Date
ga: Dáta éagtha

source: Card Security Code
ga: Cód Slándála Cárta

source: Invalid date format %(value)s: %(e)s
ga: Data neamhbhailí formáid %(value)s: %(e)s

source: SILKY_AUTHENTICATION can not be enabled without Session, Authentication or Message Django's middlewares
ga: Ní féidir Silky_Authentication a chumasú gan seisiún, fíordheimhniú nó teachtaireacht Django's Middlewares

source: A valid timezone is required.
ga: Teastaíonn crios ama bailí.

source: 1 second ago
ga: 1 soicind ó shin

source: 1 minute ago
ga: 1 nóiméad ó shin

source: 1 hour ago
ga: 1 uair ó shin

source: yesterday
ga: an lá inné

source: yesterday at %(time)s
ga: Inné ag %(time)s

source: %(weekday)s at %(time)s
ga: %(weekday)s ag %(time)s

source: %(month_name)s %(day)s at %(time)s
ga: %(month_name)s %(day)s ag %(time)s

source: %(month_name)s %(day)s, %(year)s at %(time)s
ga: %(month_name)s %(day) s, %(year)s ag %(time)s

source: %(commas)s and %(last)s
ga: %(commas)s agus %(last)s

# law
source: right
ga: Ar an gceart

# good
source: right
ga: Ar an gceart

source: Upcoming Events
ga: Imeachtaí atá le teacht

source: Find Events
ga: Faigh Imeachtaí

source: Keyword:
ga: Eochairfhocal:

source: Concert, festival, artist...
ga: Ceolchoirm, Féile, Ealaíontóir ...

source: Near Location (Optional):
ga: In aice le suíomh (roghnach):

source: e.g., Dublin City Centre
ga: e.e., lár chathair Bhaile Átha Cliath

source: Use My Location
ga: Úsáid mo shuíomh

source: Radius (km):
ga: Ga (km):

source: Start Date:
ga: Dáta Tosaigh:

source: End Date:
ga: Dáta deiridh:

source: Search Events
ga: Imeachtaí Cuardaigh

source: Reset Filters
ga: Scagairí athshocraithe

source: Loading events...
ga: Imeachtaí a luchtú ...

source: No events found matching your criteria.
ga: Níor aimsíodh aon imeachtaí a mheaitseálann do chritéir.

source: Bike
ga: Rosca

source: E-Bike
ga: R-rothair

source: E-Scooter
ga: R-scútar

source: Available Transport
ga: An t -iompar atá ar fáil

source: Type:
ga: Cineál:

source: All
ga: Gach

source: Minimum Battery:
ga: Ceallraí íosta:

source: Get Direction
ga: Faigh Treoir

source: Find your way
ga: Faigh do bhealach

source: Search locations
ga: Suíomhanna cuardaigh

source: Search
ga: Cuardach

source: My Location
ga: Mo Suíomh

source: Trip Management
ga: Bainistíocht turais

source: Current Status
ga: Stádas reatha

source: Loading
ga: Lódáil

source: Loading controls
ga: Rialuithe luchtaithe

source: Select Categories
ga: Roghnaigh Catagóirí

source: About GoRide
ga: Maidir le Goride

source: GoRide: A Journey by Two Ukrainian Students
ga: Goride: Turas le beirt mhac léinn Úcráinis

source: We’re Alex and Oleksandr, two friends from Ukraine, building a greener way to explore the city.
ga: Táimid Alex agus Oleksandr, beirt chairde ón Úcráin, ag tógáil bealach níos glaise chun an chathair a iniúchadh.

source: Our Story
ga: Ár scéal

source: The Struggle That Sparked GoRide
ga: An streachailt a spreag goride

source: Back in 2023, we were just two Ukrainian students at TU Dublin, Tallaght Campus, trying to survive university life. The campus was far from our place, and relying on public transport was a nightmare – buses were late, overcrowded, and it took ages to get anywhere. We knew there had to be a better way, so we decided to create one ourselves.
ga: Ar ais i 2023, ní raibh againn ach beirt mhac léinn Úcráinis ag TU Bhaile Átha Cliath, Campas Tallaght, ag iarraidh maireachtáil le saol na hollscoile.Bhí an campas i bhfad ón áit a bhí againn, agus bhí tromluí ag brath ar iompar poiblí - bhí busanna déanach, plódaithe, agus thóg sé aoiseanna chun dul in áit ar bith.Bhí a fhios againn go raibh ar bhealach níos fearr a bheith ann, mar sin shocraíomar muid féin a chruthú.

source: From Late-Night Coding to Real Rides
ga: Ó chódú déanach san oíche go fíor-turais

source: We spent countless nights coding GoRide in our dorms, fueled by borscht, coffee, and Ukrainian grit. Our first bike test ended with Oleksandr stuck in a puddle – we laughed so hard we forgot how to code for a day! But by 2025, GoRide was live, helping people zip around Dublin on electric bikes and scooters, all while keeping the planet green.
ga: Chaith muid oíche gan choinne ag códú gorde inár dorms, a chuir borscht, caife, agus grit na hÚcráine chun cinn.Tháinig deireadh lenár gcéad tástáil rothar le Oleksandr greamaithe i lochán - rinneamar gáire chomh crua sin go ndearna muid dearmad ar conas cód a dhéanamh ar feadh lae!Ach faoi 2025, bhí Goride beo, ag cuidiú le daoine zip timpeall Bhaile Átha Cliath ar rothair agus scútair leictreacha, agus an phláinéid a choinneáil glas.

source: The GoRide Team
ga: An Fhoireann Goride

source: Alex – The Full Stack Enthusiast
ga: Alex - an díograiseoir iomlán stack

source: I’m Oleksandr, but everyone calls me Alex. Together with my friend, I worked on the backend to make GoRide run smoothly. But I also poured my heart into the design – creating the app’s look and the avatar system, so you can ride in style!
ga: Is mise Oleksandr, ach glaonn gach duine orm Alex.In éineacht le mo chara, d'oibrigh mé ar an inneall chun Goride a reáchtáil go réidh.Ach dhoirt mé mo chroí isteach sa dearadh freisin - ag cruthú cuma an aip agus an córas avatar, ionas gur féidir leat turas a dhéanamh i stíl!

source: Oleksandr – The Server Master
ga: Oleksandr - Máistir an fhreastalaí

source: I’m Oleksandr, the other half of GoRide. I teamed up with Alex on the backend, but I also focused on setting up the servers and APIs to keep everything running like a dream. We both gave our all to make GoRide happen!
ga: Is mise Oleksandr, an leath eile de Goride.Chuaigh mé i gcomhar le Alex ar an inneall, ach dhírigh mé freisin ar na freastalaithe agus na APIs a bhunú chun gach rud a choinneáil ag rith mar bhrionglóid.Thug an bheirt againn an t -iomlán chun go dtarlódh Goride!

source: Our Mission
ga: Ár Misean

source: GoRide is more than just a rental service – it’s our way of making city travel eco-friendly, affordable, and fun. We want to help people explore Dublin without the hassle of unreliable transport, all while reducing emissions. And yeah, we added a cool avatar system because we believe even your virtual self deserves to look awesome!
ga: Tá Goride níos mó ná seirbhís ar cíos amháin-is é an bealach atá againn chun taisteal na cathrach a dhéanamh neamhdhíobhálach don chomhshaol, inacmhainne, agus spraoi.Is mian linn cabhrú le daoine iniúchadh a dhéanamh ar Bhaile Átha Cliath gan an t -iompar neamhiontaofa a bheith ann, agus astaíochtaí á laghdú acu.Agus yeah, chuireamar córas avatar fionnuar leis mar creidimid go bhfuil fiú do fhéinfhíorúil tuillte ag cuma iontach!

source: Urban Scene
ga: Radharc Uirbeach

source: Join the GoRide Revolution!
ga: Bí ar an Réabhlóid Goride!

source: We’re two Ukrainian students with a big dream, and we’d love for you to be part of it. Download the app, rent a ride, and let’s make cities greener together!
ga: Is beirt mhac léinn Úcráinis a bhfuil aisling mhór againn, agus ba bhreá linn go mbeadh tú mar chuid de.Íoslódáil an feidhmchlár, turas a fháil ar cíos, agus déanaimis cathracha níos glaise le chéile!

source: Jack is riding to your page...
ga: Tá Jack ag marcaíocht ar do leathanach ...

source: Please wait a moment
ga: Fan nóiméad le do thoil

source: Admin Chats
ga: Comhráite riaracháin

source: Support Chat
ga: Comhrá tacaíochta

source: New Message
ga: Teachtaireacht nua

source: Expand
ga: Leathnú
